app/Models/TipModel.php

    public function getdataTemporary()
    {
        return $this->db->table('tblmas_temporary_tip_tracking')->get()->getResultArray();
---
SELECT *
FROM `tblmas_temporary_tip_tracking`

    public function getDateTime()
    {
        return $this->db->table('tblmas_tip_tracking')->groupBy('month(time_out)')->groupBy('year(time_out)')->get()->getResultArray();
---
SELECT *
FROM `tblmas_tip_tracking`
GROUP BY month(time_out), year(time_out)

    public function getdataDriver()
    {
        return $this->db->table('tblmas_driver')->get()->getResultArray();
---
SELECT *
FROM `tblmas_driver`

    public function getdataLorry()
    {
        return $this->db->table('tblmas_lorry')->get()->getResultArray();
---
SELECT *
FROM `tblmas_lorry`

    public function getdataValue()
    {
        return $this->db->table('tblmas_value')->get()->getResultArray();
---
SELECT *
FROM `tblmas_value`